#pragma once
#include "FVertexStruct.h"

static FVertexSimple GGizmoCubeVertices[] =
{
    // -------------------- 큐브 정점 (Vertices) --------------------
    //    v1 ------ v2
    //   /|        /|
    //  v5 ------ v6|
    //  | |       | |
    //  | v0 ------|v3
    //  |/        |/
    //  v4 ------ v7

    //       POSITION                   COLOR
    { -0.5f, -0.5f, -0.5f,   1.0f, 0.0f, 0.0f, 1.0f }, // v0
    { -0.5f,  0.5f, -0.5f,   1.0f, 0.0f, 0.0f, 1.0f }, // v1
    {  0.5f,  0.5f, -0.5f,   1.0f, 0.0f, 0.0f, 1.0f }, // v2
    {  0.5f, -0.5f, -0.5f,   1.0f, 0.0f, 0.0f, 1.0f }, // v3
    { -0.5f, -0.5f,  0.5f,   1.0f, 0.0f, 0.0f, 1.0f }, // v4
    { -0.5f,  0.5f,  0.5f,   1.0f, 0.0f, 0.0f, 1.0f }, // v5
    {  0.5f,  0.5f,  0.5f,   1.0f, 0.0f, 0.0f, 1.0f }, // v6
    {  0.5f, -0.5f,  0.5f,   1.0f, 0.0f, 0.0f, 1.0f }  // v7
};

static uint32 GGizmoCubeIndices[] =
{
    // -------------------- 큐브 인덱스 (Indices) --------------------
    // DirectX는 왼손 좌표계를 사용하므로, 밖에서 봤을 때
    // 삼각형 정점이 시계 방향(Clockwise)으로 감기도록 인덱스를 구성합니다.

    // 앞면 (Front Face)
    4, 5, 6,
    4, 6, 7,

    // 뒷면 (Back Face)
    0, 2, 1,
    0, 3, 2,

    // 윗면 (Top Face)
    1, 6, 5,
    1, 2, 6,

    // 아랫면 (Bottom Face)
    0, 4, 7,
    0, 7, 3,

    // 오른쪽 면 (Right Face)
    3, 6, 2,
    3, 7, 6,

    // 왼쪽 면 (Left Face)
    0, 1, 5,
    0, 5, 4
};