#pragma once
#include "FVertexStruct.h"

// -------------------- 실린더 위에 놓일 큐브 데이터 --------------------

// 실린더 윗면(Y=1.0)에 위치하도록 Y축으로 1.5만큼 이동한 큐브
static FVertexSimple GGizmoCubeVertices[] =
{
    //       POSITION (Y + 1.5f)         COLOR (Blue)
    { -0.7f, 0.5f, -0.5f,   0.0f, 0.0f, 1.0f, 1.0f }, // v0 (원래 Y는 -0.5)
    { -0.5f, 1.5f, -0.5f,   0.0f, 0.0f, 1.0f, 1.0f }, // v1 (원래 Y는  0.5)
    {  0.5f, 1.5f, -0.5f,   0.0f, 0.0f, 1.0f, 1.0f }, // v2
    {  0.5f, 0.5f, -0.5f,   0.0f, 0.0f, 1.0f, 1.0f }, // v3
    { -0.5f, 0.5f,  0.5f,   0.0f, 0.0f, 1.0f, 1.0f }, // v4
    { -0.5f, 1.5f,  0.5f,   0.0f, 0.0f, 1.0f, 1.0f }, // v5
    {  0.5f, 1.5f,  0.5f,   0.0f, 0.0f, 1.0f, 1.0f }, // v6
    {  0.5f, 0.5f,  0.5f,   0.0f, 0.0f, 1.0f, 1.0f }  // v7
};

// 큐브의 인덱스, 실린더 정점 개수(17개)만큼 오프셋을 더해줍니다.
static uint32 GGizmoCubeIndices[] =
{
    // 앞면 (Front Face)
    4 + 17, 5 + 17, 6 + 17,
    4 + 17, 6 + 17, 7 + 17,

    // 뒷면 (Back Face)
    0 + 17, 2 + 17, 1 + 17,
    0 + 17, 3 + 17, 2 + 17,

    // 윗면 (Top Face)
    1 + 17, 6 + 17, 5 + 17,
    1 + 17, 2 + 17, 6 + 17,

    // 아랫면 (Bottom Face)
    0 + 17, 4 + 17, 7 + 17,
    0 + 17, 7 + 17, 3 + 17,

    // 오른쪽 면 (Right Face)
    3 + 17, 6 + 17, 2 + 17,
    3 + 17, 7 + 17, 6 + 17,

    // 왼쪽 면 (Left Face)
    0 + 17, 1 + 17, 5 + 17,
    0 + 17, 5 + 17, 4 + 17
};